ve2cuy/breadboard-PC/arduino/8088_bridge_stm32/src/main.cpp
#include <Arduino.h>
// ============================================================================
// main.cpp (projet PlatformIO 8088_bridge_stm32)  -  Pont WeAct Black Pill V3.1 (STM32F411) <-> 8088
//                              (8255 en MODE 2)
//
// Portage de ve2cuy_bridge.ino (Arduino UNO) - MEME PROTOCOLE cote 8088: le
// firmware du 8088 (Solution-01) n'est pas modifie. Voir README.md (meme
// dossier) pour le cablage, les niveaux 3,3 V / 5 V et la mise en route.
//
// Roles (inchanges):
//   - clavier PS/2  : decode la trame (CLK/DATA), verifie parite/stop, envoie
//                     le scan code brut (Set 2) au 8088;
//   - UART          : port serie virtuel USB (USB natif, "Serial") <-> 8088;
//   - LCD 20x4 I2C  : possede le bus I2C et le protocole PCF8574/HD44780.
//
// 8088 -> pont : le 8088 pose le CANAL sur le Port B (PB0/PB1 du 8255) puis
//     ecrit le Port A; OBF# passe a 0. On lit le canal, on abaisse ACK#, on lit
//     l'octet, on relache ACK#. canal 0 = octet UART, 1 = commande LCD, 2 =
//     donnee LCD.
// pont -> 8088 : on pose l'etiquette TAG (PC0: 0 = scan code, 1 = octet UART
//     recu; PC1 = 1: REPONSE a une commande), l'octet sur le bus, et on pulse
//     STB#; INTR du 8255 (sur IR1 du 8259) interrompt le 8088.
// canal 3 = COMMANDES pour le pont (voir Solution-01/lib/bridge.asm):
//     00h PING (reponse B1h, 3, capacites)   01h LIRE l'heure (reponse: 8 octets)
//     02h + 7 octets REGLER l'heure (annee 2 octets, mois, jour, h, min, s).
//     03h VERSION du firmware (PAS le "3" de PING ci-dessus, qui est le numero
//     de VERSION DU PROTOCOLE - sans rapport) -> 2 octets (majeure, mineure).
//     Necessite TAG1 (PB5) relie a PC1 du 8255 (tire a 0 par 10 kohm).
//     10h-19h = DISQUE: fichiers FAT (racine, noms 8.3) sur la flash SPI (W25Q64, 8 Mo) de la carte
//     (PA4 = CS, SPI1 PA5/PA6/PA7): statut, formater, ouvrir, lire, ecrire, fermer,
//     repertoire (debut / suivant), supprimer, espace libre. Voir lib/bridge.asm.
//     2Ch + 1 octet (action) = HORLOGE du 8088 (PA3, PWM materiel, voir clockExec ci-dessous):
//     0 lire, 1 +0,1 MHz, 2 -0,1 MHz, 3 +1 MHz, 4 -1 MHz, 5 -> 4,77 MHz, 6 -> 8 MHz
//     -> reponse 4 octets = Hz resultant.
//
// CABLAGE (voir le tableau du README.md)
//   D0-D3 <-> PB12-PB15 et D4-D7 <-> PB6-PB9  <->  8255 PA0-PA7 (bus de donnees)
//   PB0 -> ACK# (PC6)   PB1 -> STB# (PC4)   PA8 <- OBF# (PC7)   PB4 -> TAG (PC0)
//   PA9 <- canal bit 0 (8255 PB0)   PA10 <- canal bit 1 (8255 PB1)
//   PA15 <- IBF (PC5, facultatif)   PB5 -> TAG1 (PC1)
//   PA3 -> CLK du 8088 (broche 19, PWM materiel TIM2 CH4 - remplace le fil depuis l'Arduino UNO
//   R4 de projets/Clock-8088/; PA3 servait a TAG2/PC2, jamais cablee sur ce montage - libre)
//   PA1 <- CLK PS/2   PA2 <- DATA PS/2   PB10 = SCL, PB3 = SDA (LCD I2C2)
//   PA11/PA12 = USB, PA13/PA14 = SWD, PC13 = LED, PA4-PA7 = flash SPI (reservees),
//   PB2 -> RESET du 8088 (broche 21, actif HAUT; 10 kohm vers la masse sur le montage, bouton vers +5 V):
//   poussee HAUT pour un reset (demarrage du pont, Ctrl-Alt-Suppr au PS/2, Ctrl-\ au terminal), sinon
//   ENTREE (ne gene pas le bouton, jamais forcee BAS). PB2 = BOOT1: au repos la ligne est BASSE (10 kohm),
//   le mode DFU (BOOT0 = 1, BOOT1 = 0) reste donc utilisable.   PA0 = bouton K1 de la carte
// Selon la fiche technique du STM32F411 (DS10314 Rev 8, tableau 8), TOUTES ces
// broches sont tolerantes 5 V (FT) SAUF PA0 et PB5 (TC, 3,3 V): PB5 n'est donc
// utilisee qu'en SORTIE (TAG1). Ne jamais y relier une sortie 5 V.
// ============================================================================
#include <Wire.h>
#include <HardwareTimer.h>
#include <STM32RTC.h>
#include <SPI.h>
#include <SdFat.h>
#include <Adafruit_SPIFlash.h>
#ifdef USE_TINYUSB
// Environnement PlatformIO blackpill_f411ce_usbdrive: pile USB Adafruit TinyUSB (port serie CDC +
// lecteur de masse). Le nom Serial y est inutilisable (macros croisees de la bibliotheque): on
// passe par UsbSerial. Sans USE_TINYUSB: pile USB du coeur STM32 (CDC seul), UsbSerial = Serial.
#include <Adafruit_TinyUSB.h>
#define UsbSerial SerialTinyUSB
#else
#define UsbSerial Serial
#endif

// ---- reglages -------------------------------------------------------------
#define LCD_ADDR    0x27     // 0x3F pour un PCF8574A
// IBF (PC5 du 8255) cable sur PA15 ? 1 = oui: on n'envoie un octet que si le 8088 a lu le
// precedent (aucun octet ecrase); 0 = non cable. Non cable, PA15 est tiree a 0 (= libre).
#define USE_IBF     1
// Espace MINIMAL entre deux octets pont -> 8088, en plus de IBF. Le 8088 met ~ 0,5 ms
// par caractere saisi (echo compris): a plus de ~ 2000 caracteres/s il ne suit plus et
// son tampon de reception (256 octets) deborde pendant un long collage.
#define GAP_US      1000UL
// Espace minimal entre deux octets de REPONSE (horloge, disque, secteurs, image de disquette): avec IBF
// cable (USE_IBF 1), un octet ne part que quand le 8088 a lu le precedent (IBF = 0): l'espace de 1 ms n'est
// plus necessaire et les blocs de 32 octets des secteurs partent au rythme de l'interruption du 8088
// (~ 150-300 us par octet) au lieu de 1 ms. Sans IBF (USE_IBF 0), les reponses gardent GAP_US.
#define REPLY_GAP_US 20UL
// Pause apres chaque retour chariot (CR) venant du PC: le 8088 traite la ligne saisie
// (tokenisation, insertion dans le programme) avant de recevoir la suivante. 0 = aucune.
#define LINE_DELAY_MS 15UL
// Apres une commande du 8088 au pont (disque, horloge...), le 8088 est occupe: ses instructions
// (OPEN, PRINT#, WRITE#, CLOSE...) durent des dizaines de ms et il ne vide pas son tampon de
// reception (256 octets). On suspend l'envoi des octets UART (collage) jusqu'a ce delai apres la
// derniere commande, sinon un collage de plusieurs lignes deborde ce tampon.
#define CMD_HOLD_MS   250UL
#define TX_STALL_MS 100UL    // port USB sans lecteur: on jette l'octet apres ce delai
#define HEARTBEAT   1        // 1 = LED (PC13, active a l'etat bas) clignote a 1 Hz
// Horloge temps reel: 1 = quartz LSE 32,768 kHz de la carte (precis; la carte V3.1 le
// porte), 0 = oscillateur interne LSI (imprecis). Sans pile sur VBAT l'heure est
// perdue a la mise hors tension.
#define RTC_USE_LSE 1
// Diagnostic disque: 1 = chaque commande disque recue est signalee sur le port serie USB
// ([fs] op=.. flash=.. fs=..), melangee a la sortie du BASIC. A remettre a 0 ensuite.
#define DEBUG_FS 0
#ifdef USE_TINYUSB
#define USB_CAPS 0x1F        // RTC + disque + secteurs + lecteur USB + image de disquette (+ 2Bh somme de controle)
#else
#define USB_CAPS 0x17
#endif
#define CMD_TIMEOUT_MS 100UL // commande a arguments incomplete: abandonnee apres ce delai
// Version du FIRMWARE du pont (PAS le numero de version du protocole - "3" -
// deja renvoye par PING, sans rapport) - interrogee par le 8088 (commande 03h,
// "4) Information" du sous-menu Configuration, Solution-01/solution-01.asm) et
// affichee telle quelle a l'utilisateur. A incrementer manuellement lors de
// changements notables a ce fichier.
#define FW_VERSION_MAJOR 1
#define FW_VERSION_MINOR 2
// Le clavier envoie 0F0h puis le code de la touche COUP SUR COUP. Toute impulsion
// sur STB#/ACK#/bus pendant qu'une trame PS/2 arrive risque de la perturber: on
// n'agit donc sur le bus 8255 que si CLK est silencieux depuis:
#define KBD_QUIET_US 3000UL  // avant d'ENVOYER un octet clavier (fin de la rafale)
#define BUS_QUIET_US 400UL   // avant tout autre acces au bus (trame en cours)
// Filtrage du bruit sur CLK/DATA: un vrai front descendant de CLK reste bas >=
// 30 us, un parasite de diaphonie quelques us seulement.
#define PS2_GLITCH_US    10UL  // CLK doit etre encore basse apres ce delai
#define PS2_FRAME_GAP_US 250UL // sans front valide depuis: nouvelle trame
#define DEBUG_PS2   0        // 1 = trace PS/2 sur le terminal (Serial), voir dbg*()

// ---- broches --------------------------------------------------------------
// Les signaux sont lus et ecrits par registres (BSRR/IDR) pour garder les temps
// de l'instantane (voir takeFrom8088).
#define ACK_BIT   0                  // GPIOB, sortie drain ouvert (10 kohm vers +5 V)
#define STB_BIT   1                  // GPIOB, sortie drain ouvert (10 kohm vers +5 V)
#define TAG_BIT   4                  // GPIOB, sortie
#define TAG1_BIT  5                  // GPIOB, sortie SEULEMENT (PB5 n'est pas tolerante 5 V)
#define OBF_BIT   8                  // GPIOA, entree
#define CH0_BIT   9                  // GPIOA, entrees (canal = Port B du 8255)
#define CH1_BIT   10
#define IBF_BIT   15                 // GPIOA, entree (facultatif)
#define PS2_CLK_BIT  1               // GPIOA, interruption EXTI1
#define PS2_DATA_BIT 2               // GPIOA
const uint32_t PIN_ACK = PB0, PIN_STB = PB1, PIN_TAG = PB4;
const uint32_t PIN_OBF = PA8, PIN_CH0 = PA9, PIN_CH1 = PA10, PIN_IBF = PA15;
const uint32_t PIN_TAG1 = PB5;                         // PC1 (etiquette etendue, futur)
const uint32_t PIN_PS2_CLK = PA1, PIN_PS2_DATA = PA2;
const uint32_t PIN_SCL = PB10, PIN_SDA = PB3;          // I2C2 (AF4 / AF9)
const uint32_t PIN_CLK8088 = PA3;                      // TIM2 CH4: horloge du 8088 (broche CLK, 19) -
                                                         // remplace le fil depuis l'Arduino UNO R4 (projets/Clock-8088)
                                                         // - PA3 servait a TAG2/PC2, jamais cablee sur ce montage

