ve2cuy/breadboard-PC/arduino/8088_bridge_stm32/src/main.cpp
// Bus de donnees sur GPIOB, en deux quartets: D0-D3 = PB12-PB15, D4-D7 = PB6-PB9
#define BUS_ODR_MASK   ((0xFUL << 12) | (0xFUL << 6))
#define BUS_MODER_MASK 0xFF0FF000UL  // 2 bits par broche: PB12-15 (bits 24-31) et PB6-9 (bits 12-19)
#define BUS_MODER_OUT  0x55055000UL  // 01 = sortie
// Sur le montage, les broches PA4-PA7 du 8255 arrivent dans l'ORDRE INVERSE
// (constate: espace 0x20 recu 0x40, 'p' 0x70 recu 0xE0): le quartet haut est
// inverse (D4<->D7, D5<->D6), comme sur l'UNO. 1 = corrige en logiciel, 0 = bus
// cable dans l'ordre (D0-D7 <-> PA0-PA7).
#define BUS_HIGH_NIBBLE_REVERSED 1

// ---- canaux 8088 -> pont (Port B du 8255) ---------------------------------
const uint8_t CH_UART     = 0;
const uint8_t CH_LCD_CMD  = 1;
const uint8_t CH_LCD_DATA = 2;
const uint8_t CH_CMD      = 3;         // commandes pour le pont (horloge...)

// ============================================================================
// Acces rapide aux broches (registres GPIO)
// ============================================================================
static inline void ackLow()  { GPIOB->BSRR = (1UL << (ACK_BIT + 16)); }
static inline void ackHigh() { GPIOB->BSRR = (1UL << ACK_BIT); }
static inline void stbLow()  { GPIOB->BSRR = (1UL << (STB_BIT + 16)); }
static inline void stbHigh() { GPIOB->BSRR = (1UL << STB_BIT); }
static inline bool obfHigh() { return (GPIOA->IDR >> OBF_BIT) & 1; }   // 1 = rien en attente
static inline void tagWrite(uint8_t t) {   // t = 0: scan code, 1: octet UART, 2: reponse
  GPIOB->BSRR = (t & 1) ? (1UL << TAG_BIT) : (1UL << (TAG_BIT + 16));
  GPIOB->BSRR = (t & 2) ? (1UL << TAG1_BIT) : (1UL << (TAG1_BIT + 16));
}

// ============================================================================
// Bus Port A du 8255 = PB12-PB15 (D0-D3) + PB6-PB9 (D4-D7) (MODER/BSRR/IDR)
// ============================================================================
static inline void busRelease() {          // haute impedance, sans pull
  GPIOB->MODER &= ~BUS_MODER_MASK;         // 00 = entree
}

// Inverse l'ordre des 4 bits du quartet haut (involution: sert a la lecture et a l'ecriture)
static inline uint8_t fixHighNibble(uint8_t v) {
#if BUS_HIGH_NIBBLE_REVERSED
  uint8_t h = (uint8_t)(v >> 4);
  h = (uint8_t)(((h & 1) << 3) | ((h & 2) << 1) | ((h & 4) >> 1) | ((h & 8) >> 3));
  return (uint8_t)((v & 0x0F) | (h << 4));
#else
  return v;
#endif
}

static inline uint8_t busFromIdr(uint32_t idr) {
  return fixHighNibble((uint8_t)(((idr >> 12) & 0x0F) | ((idr >> 2) & 0xF0)));
}

static inline void busDrive(uint8_t v) {   // niveau AVANT de passer en sortie
  v = fixHighNibble(v);
  uint32_t set = ((uint32_t)(v & 0x0F) << 12) | ((uint32_t)(v & 0xF0) << 2);
  GPIOB->BSRR = ((BUS_ODR_MASK & ~set) << 16) | set;
  GPIOB->MODER = (GPIOB->MODER & ~BUS_MODER_MASK) | BUS_MODER_OUT;
}

// pont -> 8088: octet + etiquette, puis impulsion STB#.
#if DEBUG_FS
static uint8_t dbgIbfAfter = 0;
#endif
static void sendTo8088(uint8_t tag, uint8_t v) {
  tagWrite(tag);
  busDrive(v);
  delayMicroseconds(2);
  stbLow();
  delayMicroseconds(2);
  stbHigh();                               // front montant: le 8255 verrouille
  delayMicroseconds(2);
#if DEBUG_FS
  dbgIbfAfter = (uint8_t)((GPIOA->IDR >> IBF_BIT) & 1);   // IBF doit valoir 1 (octet non lu)
#endif
  busRelease();
}

// 8088 -> pont: si OBF# est bas, lit canal + octet. ACK# bas = le 8255 pilote
// le bus (les broches sont des entrees a ce moment-la). INSTANTANE indispensable:
// le 8255 remet OBF# a 1 des que ACK# DESCEND, donc le 8088 peut ecrire l'octet
// suivant ~15 us plus tard, pendant qu'on lit encore le bus. Ici les deux ports
// sont lus en quelques cycles (< 100 ns).
static bool takeFrom8088(uint8_t &chan, uint8_t &val) {
  if (obfHigh()) return false;             // rien en attente
  ackLow();
  delayMicroseconds(2);                    // tAOD du 8255 < 200 ns
  uint32_t b = GPIOB->IDR;
  uint32_t a = GPIOA->IDR;
  ackHigh();
  val  = busFromIdr(b);
  chan = (uint8_t)(((a >> CH0_BIT) & 1) | (((a >> CH1_BIT) & 1) << 1));
  return true;
}

// ============================================================================
// File 8088 -> peripheriques (256 entrees, 255 utiles)
// ============================================================================
struct Item { uint8_t chan; uint8_t val; };
static Item   q[256];
static uint8_t qHead = 0, qTail = 0;
static inline bool qEmpty() { return qHead == qTail; }
static inline bool qFull()  { return (uint8_t)(qHead + 1) == qTail; }

// ============================================================================
// Horloge temps reel et commandes du canal 3
// ============================================================================
static STM32RTC &rtc = STM32RTC::getInstance();

static uint8_t rq[64];                     // reponses en attente d'envoi au 8088
static uint8_t rqHead = 0, rqTail = 0;
static void replyByte(uint8_t v) {
  uint8_t nh = (uint8_t)((rqHead + 1) & 63);
  if (nh != rqTail) { rq[rqHead] = v; rqHead = nh; }
}

// Lecture COHERENTE par registres: SSR d'abord (verrouille les registres image), puis
// TR et DR (deverrouille). Centiemes = (PREDIV_S - SSR) / (PREDIV_S + 1) * 100.
static void replyTime() {
  uint32_t ss = RTC->SSR;
  uint32_t tr = RTC->TR;
  uint32_t dr = RTC->DR;
  uint32_t prediv = RTC->PRER & 0x7FFFUL;
  uint8_t hh = (uint8_t)(((tr >> 20) & 3) * 10 + ((tr >> 16) & 15));
  uint8_t mm = (uint8_t)(((tr >> 12) & 7) * 10 + ((tr >> 8) & 15));
  uint8_t sc = (uint8_t)(((tr >> 4) & 7) * 10 + (tr & 15));
  uint16_t year = (uint16_t)(2000 + ((dr >> 20) & 15) * 10 + ((dr >> 16) & 15));
  uint8_t mo = (uint8_t)(((dr >> 12) & 1) * 10 + ((dr >> 8) & 15));
  uint8_t dd = (uint8_t)(((dr >> 4) & 3) * 10 + (dr & 15));
  uint32_t cs = (ss <= prediv) ? ((prediv - ss) * 100UL) / (prediv + 1UL) : 0;
  if (cs > 99) cs = 99;
  replyByte((uint8_t)year); replyByte((uint8_t)(year >> 8));
  replyByte(mo); replyByte(dd); replyByte(hh); replyByte(mm); replyByte(sc);
  replyByte((uint8_t)cs);
}

static void applyTime(const uint8_t *a) {  // annee (2 octets), mois, jour, h, min, s
  uint16_t year = (uint16_t)(a[0] | (a[1] << 8));
  if (year < 2000 || year > 2099 || a[2] < 1 || a[2] > 12 || a[3] < 1 || a[3] > 31 ||
      a[4] > 23 || a[5] > 59 || a[6] > 59) return;               // valeurs invalides: ignore
  rtc.setDate(a[3], a[2], (uint8_t)(year - 2000));
  rtc.setTime(a[4], a[5], a[6]);
}

// ============================================================================
// Horloge du 8088 (PA3 = TIM2 CH4, PWM materiel, duty cycle fixe 1/3 - voir
// projets/Clock-8088/src/main.cpp, meme principe mais sur l'Arduino UNO R4 separe
// d'origine: ici, l'horloge est generee par CE MEME pont, plus besoin de 2e carte).
// clockSetup() DOIT etre appelee EN PREMIER dans setup() (avant SPI/USB/RTC, qui
// prennent du temps): le 8088 a besoin d'une horloge stable des sa mise sous tension.
// Valeur courante en Hz (pas de table fixe - reglage continu par pas de 100 kHz ou
// 1 MHz), bornee a [1, 10] MHz, 4,77 MHz par defaut au demarrage de ce pont (vitesse
// du PC IBM d'origine). Commande 2Ch (1 octet d'argument, le CODE D'ACTION, numerote
// comme les options du sous-menu Clock speed - voir Solution-01/solution-01.asm) ->
// reponse 4 octets = la frequence REELLEMENT GENEREE en Hz (poids faible d'abord,
// meme convention que fs_free/fs_dir_next - voir Solution-01/lib/bridge.asm) -
// PAS la frequence demandee (voir actualClockHz ci-dessous, et Directives.md: rapporte
// sur le materiel reel, mesure a l'oscilloscope - un ecart pouvant depasser 4% a ete
// observe entre la frequence demandee et la frequence reellement generee, l'arrondi
// du prescaler/de l'ARR du minuteur devenant significatif loin de 4,77 MHz - PLUS le
// double arrondi entier de HardwareTimer::setOverflow(), voir
// framework-arduinoststm32/.../HardwareTimer.cpp):
//   0 = ne rien changer (sert de LIRE), 1 = +0,1 MHz, 2 = -0,1 MHz, 3 = +1 MHz,
//   4 = -1 MHz, 5 = aller a 4,77 MHz, 6 = aller a 8 MHz.
// ============================================================================
#define CLOCK_MIN_HZ     1000000UL
#define CLOCK_MAX_HZ    10000000UL
#define CLOCK_DEFAULT_HZ 4770000UL
#define CLOCK_STEP_SMALL  100000UL                 // 0,1 MHz
#define CLOCK_STEP_BIG   1000000UL                 // 1 MHz
static HardwareTimer clockTimer(TIM2);
static uint32_t clockHz = CLOCK_DEFAULT_HZ;        // frequence DEMANDEE (ce que le 8088 a
                                                    // demande pour la derniere fois)
static uint32_t actualClockHz = CLOCK_DEFAULT_HZ;  // frequence REELLEMENT generee, lue
                                                    // dans les registres ARR/PSC du minuteur
                                                    // APRES setPWM() (getOverflow(HERTZ_FORMAT)
                                                    // relit LL_TIM_GetAutoReload/GetPrescaler -
                                                    // les MEMES valeurs que setOverflow() vient
                                                    // d'ecrire, donc reflete fidelement ce que
                                                    // le materiel produit vraiment) - c'est
                                                    // CETTE valeur qui est renvoyee au 8088,
                                                    // PAS clockHz

