ve2cuy/breadboard-PC/arduino/8088_bridge_stm32/src/main.cpp
static void clockApply() {                         // (re)configure le PWM sur la frequence courante
  clockTimer.setPWM(4, PIN_CLK8088, clockHz, 33);
  actualClockHz = clockTimer.getOverflow(HERTZ_FORMAT);
}

// clockSetup: PREMIERE chose faite dans setup() - demarre l'horloge du 8088 a 4,77 MHz
// avant tout le reste (SPI/USB/RTC peuvent prendre plusieurs dizaines de ms).
static void clockSetup() {
  clockApply();
}

static void clockExec(uint8_t action) {
  switch (action) {
    case 1:                                          // +0,1 MHz
      clockHz = (clockHz + CLOCK_STEP_SMALL > CLOCK_MAX_HZ) ? CLOCK_MAX_HZ : clockHz + CLOCK_STEP_SMALL;
      break;
    case 2:                                          // -0,1 MHz
      clockHz = (clockHz < CLOCK_MIN_HZ + CLOCK_STEP_SMALL) ? CLOCK_MIN_HZ : clockHz - CLOCK_STEP_SMALL;
      break;
    case 3:                                          // +1 MHz
      clockHz = (clockHz + CLOCK_STEP_BIG > CLOCK_MAX_HZ) ? CLOCK_MAX_HZ : clockHz + CLOCK_STEP_BIG;
      break;
    case 4:                                          // -1 MHz
      clockHz = (clockHz < CLOCK_MIN_HZ + CLOCK_STEP_BIG) ? CLOCK_MIN_HZ : clockHz - CLOCK_STEP_BIG;
      break;
    case 5: clockHz = CLOCK_DEFAULT_HZ; break;        // 4,77 MHz
    case 6: clockHz = 8000000UL; break;               // 8 MHz
    default: break;                                   // 0 (ou inconnu) = lire seulement
  }
  if (action >= 1 && action <= 6) clockApply();
  // actualClockHz (REELLEMENT genere), PAS clockHz (seulement DEMANDE) - voir la
  // remarque en tete de section
  replyByte((uint8_t)actualClockHz); replyByte((uint8_t)(actualClockHz >> 8));
  replyByte((uint8_t)(actualClockHz >> 16)); replyByte((uint8_t)(actualClockHz >> 24));
}

// ============================================================================
// Disque: systeme de fichiers FAT sur la flash SPI (W25Q64, 8 Mo) de la carte.
// Le STM32F411 n'a pas de QUADSPI: la flash s'utilise en SPI simple (SPI1: PA4 = CS,
// PA5 = SCK, PA6 = MISO, PA7 = MOSI). Fichiers a la racine, noms 8.3.
// ============================================================================
static Adafruit_FlashTransport_SPI flashTransport(PA4, SPI);
static Adafruit_SPIFlash flash(&flashTransport);
static FatVolume fatfs;
static bool flashOk = false, fsOk = false;
static bool usbActive = false;            // USB ON: le PC a le disque (le 8088 recoit "disque non pret")
static bool fsStale = false;              // secteurs ecrits en direct: remonter le volume avant tout acces fichier
static File32 curFile, dirRoot;
static File32 imgFile;                    // image de disquette montee (commandes 27h-2Ah), independante de curFile
static bool imgOpen = false;
static uint32_t imgSize = 0;
static bool fileOpen = false, dirOpen = false;
static uint8_t curMode = 0;

enum { FSE_OK = 0, FSE_NOTREADY = 1, FSE_NOTFOUND = 2, FSE_EXISTS = 3, FSE_IO = 4,
       FSE_BADNAME = 5, FSE_OPEN = 6, FSE_NOTOPEN = 7, FSE_FULL = 8, FSE_NOSUPPORT = 9 };

// Ferme l'image de disquette (avant tout ce qui touche au volume: formatage, secteurs, USB, remontage)
static void imgClose() {
  if (imgOpen) { imgFile.close(); imgOpen = false; }
}

static void fsCloseAll() {
  if (fileOpen) { curFile.close(); fileOpen = false; flash.syncBlocks(); }
  if (dirOpen)  { dirRoot.close(); dirOpen = false; }
}

// Formate la flash en FAT16 (DETRUIT tout). Vrai si le volume est ensuite monte.
static bool fsFormat() {
  static uint8_t secBuf[512];
  fsCloseAll();
  imgClose();
  FatFormatter formatter;
  bool ok = formatter.format(&flash, secBuf, nullptr);
  flash.syncBlocks();
  fsOk = ok && fatfs.begin(&flash);
  return fsOk;
}

// Vrai si le premier secteur de la flash est entierement efface (0xFF) ou nul: flash
// neuve, formatage automatique sans risque (un disque deja utilise n'est JAMAIS
// formate sans la commande FORMAT).
static bool flashLooksBlank() {
  static uint8_t sec[512];
  if (!flash.readBlocks(0, sec, 1)) return false;
  uint8_t a = 0xFF, b = 0x00;
  for (int i = 0; i < 512; i++) { a &= sec[i]; b |= sec[i]; }
  return a == 0xFF || b == 0x00;
}

static void fsMount() {
  flashOk = flash.begin();
  fsOk = flashOk && fatfs.begin(&flash);
  if (flashOk && !fsOk && flashLooksBlank()) fsFormat();
}

// Nom 8.3 (majuscules, chiffres, . _ - $ ~) : 1-8 caracteres, point facultatif, 0-3 d'extension
static bool nameOk(const char *n) {
  int base = 0, ext = -1;
  for (const char *p = n; *p; p++) {
    char c = *p;
    if (c == '.') { if (ext >= 0 || base == 0) return false; ext = 0; continue; }
    if (!((c >= 'A' && c <= 'Z') || (c >= '0' && c <= '9') || c == '_' || c == '-' || c == '$' || c == '~'))
      return false;
    if (ext >= 0) { if (++ext > 3) return false; } else if (++base > 8) return false;
  }
  return base > 0 && ext != 0;
}

static void replyStatus(uint8_t st) { replyByte(st); }

// Execute une commande disque complete (opcode + arguments dans cmdBuf).
static void fsExec(const uint8_t *c) {
  uint8_t op = c[0];
  if (op == 0x11) { replyStatus(flashOk ? (fsFormat() ? FSE_OK : FSE_IO) : FSE_NOTREADY); return; }
  if (fsStale) { fsStale = false; fsCloseAll(); imgClose(); fsOk = flashOk && fatfs.begin(&flash); }
  if (!fsOk) {                             // pas de flash ou pas de systeme de fichiers
    if (op == 0x13 || op == 0x17) replyByte(0xFF);
    else if (op == 0x19) { for (int i = 0; i < 4; i++) replyByte(0xFF); }
    else replyStatus(FSE_NOTREADY);
    return;
  }
  switch (op) {
    case 0x10: replyStatus(FSE_OK); break;
    case 0x12: {                           // OUVRIR: mode, longueur du nom, nom
      uint8_t mode = c[1], n = c[2];
      char name[16];
      if (n < 1 || n > 12) { replyStatus(FSE_BADNAME); break; }
      for (uint8_t i = 0; i < n; i++) name[i] = (char)c[3 + i];
      name[n] = 0;
      if (!nameOk(name)) { replyStatus(FSE_BADNAME); break; }
      fsCloseAll();                        // un seul fichier ouvert: OUVRIR ferme le precedent
      oflag_t fl = (mode == 0) ? O_RDONLY : (mode == 1) ? (O_WRONLY | O_CREAT | O_TRUNC)
                                                         : (O_WRONLY | O_CREAT | O_APPEND);
      curFile = fatfs.open(name, fl);
      if (!curFile) { replyStatus(mode == 0 ? FSE_NOTFOUND : FSE_IO); break; }
      fileOpen = true; curMode = mode;
      replyStatus(FSE_OK);
      break;
    }
    case 0x13: {                           // LIRE n octets
      uint8_t n = c[1] > 32 ? 32 : c[1];
      uint8_t buf[32];
      if (!fileOpen || curMode != 0) { replyByte(0xFF); break; }
      int r = curFile.read(buf, n);
      if (r < 0) { replyByte(0xFF); break; }
      replyByte((uint8_t)r);
      for (int i = 0; i < r; i++) replyByte(buf[i]);
      break;
    }
    case 0x14: {                           // ECRIRE n octets
      uint8_t n = c[1];
      if (!fileOpen || curMode == 0) { replyStatus(FSE_NOTOPEN); break; }
      replyStatus(curFile.write(c + 2, n) == n ? FSE_OK : FSE_FULL);
      break;
    }
    case 0x15:                             // FERMER
      if (!fileOpen) { replyStatus(FSE_NOTOPEN); break; }
      curFile.close(); fileOpen = false;
      flash.syncBlocks();                  // vide le cache d'ecriture vers la flash
      replyStatus(FSE_OK);
      break;
    case 0x16:                             // REPERTOIRE: debut
      if (dirOpen) dirRoot.close();
      dirOpen = dirRoot.open("/");
      replyStatus(dirOpen ? FSE_OK : FSE_IO);
      break;
    case 0x17: {                           // entree suivante
      if (!dirOpen) { replyByte(0xFF); break; }
      File32 f;
      while (f.openNext(&dirRoot, O_RDONLY)) {
        if (f.isDir() || f.isHidden()) { f.close(); continue; }
        // Nom LONG s'il tient en 8.3 (12 caracteres: "hello.asm" garde sa casse), sinon le nom
        // COURT (ex. "pcdos2_1_bug.img" -> "PCDOS2~1.IMG", que le 8088 peut ouvrir tel quel).
        // Avant: getName() dans un tampon de 16 octets ECHOUAIT pour un nom long de 16+
        // caracteres -> longueur 0 = "plus d'entree" pour le 8088: la liste s'arretait LA et
        // tous les fichiers suivants disparaissaient (FILES, List files, Boot disk image).
        char name[64];
        size_t n = f.getName(name, sizeof name);
        if (n == 0 || n > 12) n = f.getSFN(name, 13);
        uint32_t sz = f.fileSize();
        f.close();
        if (n == 0 || n > 12) continue;    // aucun nom utilisable: entree sautee, pas fin de liste
        uint8_t len = (uint8_t)strlen(name);
        replyByte(len);
        for (uint8_t i = 0; i < len; i++) replyByte((uint8_t)name[i]);
        for (int i = 0; i < 4; i++) replyByte((uint8_t)(sz >> (8 * i)));
        return;
      }
      replyByte(0);                        // plus d'entree
      break;
    }
    case 0x18: {                           // SUPPRIMER
      uint8_t n = c[1];
      char name[16];
      if (n < 1 || n > 12) { replyStatus(FSE_BADNAME); break; }
      for (uint8_t i = 0; i < n; i++) name[i] = (char)c[2 + i];
      name[n] = 0;
      if (!nameOk(name)) { replyStatus(FSE_BADNAME); break; }
      if (fileOpen) { curFile.close(); fileOpen = false; }
      bool ok = fatfs.remove(name);
      flash.syncBlocks();
      replyStatus(ok ? FSE_OK : FSE_NOTFOUND);
      break;
    }
    case 0x19: {                           // ESPACE LIBRE (octets)
      uint64_t free = (uint64_t)fatfs.freeClusterCount() * fatfs.bytesPerCluster();
      if (free > 0xFFFFFFFFULL) free = 0xFFFFFFFFULL;
      for (int i = 0; i < 4; i++) replyByte((uint8_t)(free >> (8 * i)));
      break;
    }
    default: break;
  }
}

// Acces direct aux secteurs de 512 octets (commandes 20h-24h), pour un futur DOS: passe par un
// tampon de 512 octets (secBuf), transfere par blocs de 32 octets. Ferme le fichier ouvert; apres
// une ecriture le volume FAT est remonte a la prochaine commande fichier (fsStale).
static uint8_t secBuf[512];
static uint32_t secLba(const uint8_t *c) {
  return (uint32_t)c[0] | ((uint32_t)c[1] << 8) | ((uint32_t)c[2] << 16) | ((uint32_t)c[3] << 24);
}
static void secExec(const uint8_t *c) {
  uint8_t op = c[0];
  uint32_t nsec = flashOk ? (uint32_t)(flash.size() / 512) : 0;
  if (op == 0x20) { for (int i = 0; i < 4; i++) replyByte((uint8_t)(nsec >> (8 * i))); return; }
  if (op == 0x22) {                        // OBTENIR le bloc i du tampon
    uint8_t i = c[1];
    for (int k = 0; k < 32; k++) replyByte(i < 16 ? secBuf[i * 32 + k] : 0);
    return;
  }
  if (!flashOk) { replyStatus(FSE_NOTREADY); return; }
  if (op == 0x23) {                        // DEPOSER le bloc i dans le tampon
    uint8_t i = c[1];
    if (i > 15) { replyStatus(FSE_IO); return; }
    memcpy(secBuf + i * 32, c + 2, 32);
    replyStatus(FSE_OK);
    return;
  }
  uint32_t lba = secLba(c + 1);            // 21h LIRE / 24h ECRIRE
  if (lba >= nsec) { replyStatus(FSE_IO); return; }
  fsCloseAll();
  if (op == 0x24) imgClose();              // ecriture directe: l'image montee ne serait plus coherente
  flash.syncBlocks();
  if (op == 0x21) {
    replyStatus(flash.readBlocks(lba, secBuf, 1) ? FSE_OK : FSE_IO);
  } else {
    bool ok = flash.writeBlocks(lba, secBuf, 1);
    flash.syncBlocks();
    fsStale = true;
    replyStatus(ok ? FSE_OK : FSE_IO);
  }
}

// 2Bh SOMME: somme (16 bits) des 512 octets de secBuf, envoyee apres un secteur lu (21h / 29h). Le 8088 la compare a
// celle des octets qu'il a recus et relit le secteur si elles different (octets perdus ou alteres en route).
static void secSum() {
  uint16_t sum = 0;
  for (int i = 0; i < 512; i++) sum += secBuf[i];
  replyByte((uint8_t)sum);
  replyByte((uint8_t)(sum >> 8));
}

// Image de disquette (commandes 27h-2Ah): un fichier de la racine (.IMG, le plus souvent) sert de DISQUETTE
// au 8088 (lecteur A: d'un DOS). 27h MONTER (nom) -> etat + taille (4 octets); 28h DEMONTER; 29h LIRE le
// secteur lba (dans secBuf, a relire par 22h); 2Ah ECRIRE le secteur lba (depuis secBuf, deposer par 23h).
// Les ecritures vont dans le fichier (synchronisees a chaque secteur). Un seul fichier monte a la fois.
static bool imgNameOk(const char *n, int len) {
  for (int i = 0; i < len; i++) {
    char c = n[i];
    if (!((c >= 'A' && c <= 'Z') || (c >= 'a' && c <= 'z') || (c >= '0' && c <= '9') || c == '_' || c == '-' ||
          c == '$' || c == '~' || c == '.'))
      return false;
  }
  return len > 0;
}
static void imgExec(const uint8_t *c) {
  uint8_t op = c[0];
  if (op == 0x28) { imgClose(); replyStatus(FSE_OK); return; }
  if (op == 0x27) {
    imgClose();
    uint8_t st = FSE_OK;
    uint32_t sz = 0;
    uint8_t n = c[1];
    char name[16];
    if (fsStale) { fsStale = false; fsCloseAll(); fsOk = flashOk && fatfs.begin(&flash); }
    if (!fsOk) {
      st = FSE_NOTREADY;
    } else if (n < 1 || n > 12) {
      st = FSE_BADNAME;
    } else {
      for (uint8_t i = 0; i < n; i++) name[i] = (char)c[2 + i];
      name[n] = 0;
      if (!imgNameOk(name, n)) {
        st = FSE_BADNAME;
      } else {
        imgFile = fatfs.open(name, O_RDWR);
        if (!imgFile) { st = FSE_NOTFOUND; }
        else { imgOpen = true; imgSize = imgFile.fileSize(); sz = imgSize; }
      }
    }
    replyStatus(st);
    for (int i = 0; i < 4; i++) replyByte((uint8_t)(sz >> (8 * i)));
    return;
  }
  if (!imgOpen) { replyStatus(FSE_NOTOPEN); return; }
  uint32_t lba = secLba(c + 1);
  if (((uint64_t)lba + 1) * 512ULL > imgSize || !imgFile.seekSet(lba * 512UL)) { replyStatus(FSE_IO); return; }
  if (op == 0x29) {
    replyStatus(imgFile.read(secBuf, 512) == 512 ? FSE_OK : FSE_IO);
  } else {
    bool ok = imgFile.write(secBuf, 512) == 512 && imgFile.sync();
    flash.syncBlocks();
    replyStatus(ok ? FSE_OK : FSE_IO);
  }
}

