ve2cuy/breadboard-PC/arduino/8088_bridge_stm32/src/main.cpp
// Lecteur de masse USB (environnement blackpill_f411ce_usbdrive): la flash entiere (MBR + volume FAT)
// est offerte au PC. Un seul proprietaire a la fois: USB ON (25h) donne le disque au PC, le 8088
// recoit alors "disque non pret"; USB OFF (26h) le reprend (le PC doit avoir ejecte le lecteur).
#ifdef USE_TINYUSB
static Adafruit_USBD_MSC usbMsc;
static int32_t mscRead(uint32_t lba, void *buf, uint32_t size) {
  return flash.readBlocks(lba, (uint8_t *)buf, size / 512) ? (int32_t)size : -1;
}
static int32_t mscWrite(uint32_t lba, uint8_t *buf, uint32_t size) {
  return flash.writeBlocks(lba, buf, size / 512) ? (int32_t)size : -1;
}
static void mscFlush() { flash.syncBlocks(); }
static void usbMscBegin() {              // avant UsbSerial.begin()
  usbMsc.setID("VE2CUY", "8088 Disk", "1.0");
  usbMsc.setReadWriteCallback(mscRead, mscWrite, mscFlush);
  usbMsc.setCapacity(flashOk ? (uint32_t)(flash.size() / 512) : 0, 512);
  usbMsc.setUnitReady(false);            // "pas de disque" tant que USB ON n'est pas demande
  usbMsc.begin();
}
#endif

static void usbExec(uint8_t op) {
#ifdef USE_TINYUSB
  if (!flashOk) { replyStatus(FSE_NOTREADY); return; }
  if (op == 0x25) {
    if (!usbActive) { fsCloseAll(); imgClose(); flash.syncBlocks(); usbActive = true; usbMsc.setUnitReady(true); }
  } else if (usbActive) {
    usbMsc.setUnitReady(false);
    flash.syncBlocks();
    usbActive = false;
    fsStale = true;                      // le PC a pu modifier le volume: le remonter
  }
  replyStatus(FSE_OK);
#else
  (void)op;
  replyStatus(FSE_NOSUPPORT);
#endif
}

// USB ON: toute commande disque du 8088 recoit "disque non pret" (reponse de la bonne taille)
static void diskBusy(uint8_t op) {
  if (op == 0x13 || op == 0x17) replyByte(0xFF);
  else if (op == 0x19) { for (int i = 0; i < 4; i++) replyByte(0xFF); }
  else if (op == 0x20) { for (int i = 0; i < 4; i++) replyByte(0); }
  else if (op == 0x22) { for (int i = 0; i < 32; i++) replyByte(0); }
  else if (op == 0x27) { replyStatus(FSE_NOTREADY); for (int i = 0; i < 4; i++) replyByte(0); }
  else if (op == 0x2B) { replyByte(0); replyByte(0); }
  else replyStatus(FSE_NOTREADY);
}

// Automate des commandes du canal 3: un octet d'operation, puis ses arguments.
static uint32_t uartHoldUntil = 0;         // pas d'octet UART avant cette date (ms): LINE_DELAY_MS, CMD_HOLD_MS
static uint8_t cmdBuf[264], cmdLen = 0;
static uint32_t cmdT = 0;
static int cmdNeed() {                     // nombre total d'octets de la commande en cours
  switch (cmdBuf[0]) {
    case 0x02: return 8;
    case 0x13: return 2;
    case 0x21: case 0x24: case 0x29: case 0x2A: return 5;
    case 0x27: return cmdLen >= 2 ? 2 + cmdBuf[1] : 2;
    case 0x22: return 2;
    case 0x23: return 34;
    case 0x2C: return 2;
    case 0x12: return cmdLen >= 3 ? 3 + cmdBuf[2] : 3;
    case 0x14: return cmdLen >= 2 ? 2 + cmdBuf[1] : 2;
    case 0x18: return cmdLen >= 2 ? 2 + cmdBuf[1] : 2;
    default:   return 1;                   // 00h 01h 10h 11h 15h 16h 17h 19h 20h et inconnues
  }
}
static void cmdByte(uint8_t v) {
  uint32_t now = millis();
  if (cmdLen && (uint32_t)(now - cmdT) > CMD_TIMEOUT_MS) cmdLen = 0;   // commande abandonnee
  cmdT = now;
  cmdBuf[cmdLen++] = v;
  if (cmdLen < cmdNeed()) return;
  uint8_t op = cmdBuf[0];
#if DEBUG_FS
  static bool first = true;
  if (first) {
    first = false;
    UsbSerial.print("\r\n[fs] flash JEDEC=0x"); UsbSerial.print(flashOk ? flash.getJEDECID() : 0, HEX);
    UsbSerial.print(" taille="); UsbSerial.print(flashOk ? flash.size() : 0);
    UsbSerial.print(" flashOk="); UsbSerial.print(flashOk);
    UsbSerial.print(" fsOk="); UsbSerial.print(fsOk); UsbSerial.print("\r\n");
  }
  UsbSerial.print("[br] op=0x"); UsbSerial.print(op, HEX); UsbSerial.print(" n="); UsbSerial.print(cmdLen); UsbSerial.print("\r\n");
#endif
  if (op == 0x00) { replyByte(0xB1); replyByte(3); replyByte(USB_CAPS); }        // PING: v3, RTC + disque + secteurs
  else if (op == 0x01) replyTime();
  else if (op == 0x02) applyTime(cmdBuf + 1);
  else if (op == 0x03) { replyByte(FW_VERSION_MAJOR); replyByte(FW_VERSION_MINOR); }  // version du firmware
  else if (op == 0x25 || op == 0x26) usbExec(op);
  else if (usbActive && op >= 0x10 && op <= 0x2B) diskBusy(op);
  else if (op >= 0x10 && op <= 0x19) fsExec(cmdBuf);
  else if (op >= 0x20 && op <= 0x24) secExec(cmdBuf);
  else if (op >= 0x27 && op <= 0x2A) imgExec(cmdBuf);
  else if (op == 0x2B) secSum();
  else if (op == 0x2C) clockExec(cmdBuf[1]);
  uartHoldUntil = millis() + CMD_HOLD_MS;  // le 8088 est occupe avec sa commande: pas de collage pour l'instant
  cmdLen = 0;
}

// ============================================================================
// LCD HD44780 derriere un PCF8574 (P0=RS P1=RW P2=EN P3=BL P4-P7=D4-D7)
// ============================================================================
const uint8_t LCD_RS = 0x01, LCD_EN = 0x04, LCD_BL = 0x08;

static void lcdNibble(uint8_t n) {         // n = quartet deja aligne sur D4-D7
  Wire.beginTransmission(LCD_ADDR);
  Wire.write((uint8_t)(n | LCD_BL | LCD_EN));
  Wire.write((uint8_t)(n | LCD_BL));
  Wire.endTransmission();
}

static void lcdSend(uint8_t v, uint8_t rs) {
  uint8_t hi = (uint8_t)((v & 0xF0) | LCD_BL | rs);
  uint8_t lo = (uint8_t)(((uint8_t)(v << 4) & 0xF0) | LCD_BL | rs);
  Wire.beginTransmission(LCD_ADDR);        // une seule transaction: 4 octets
  Wire.write((uint8_t)(hi | LCD_EN));
  Wire.write(hi);
  Wire.write((uint8_t)(lo | LCD_EN));
  Wire.write(lo);
  Wire.endTransmission();
  if (!rs && v <= 0x03) delayMicroseconds(2000);   // Clear / Home: >= 1,52 ms
  else                  delayMicroseconds(50);     // autres: >= 37-43 us
}

// Initialisation "par instruction" du HD44780: ramene le controleur en mode
// 4 bits depuis N'IMPORTE QUEL etat (8 bits, quartet a moitie envoye...).
static void lcdResync() {
  lcdNibble(0x30); delay(5);
  lcdNibble(0x30); delayMicroseconds(200);
  lcdNibble(0x30); delayMicroseconds(200);
  lcdNibble(0x20); delayMicroseconds(200); // bascule en 4 bits
}

static void lcdInit() {
  delay(50);                               // >= 40 ms apres mise sous tension
  lcdResync();
  lcdSend(0x28, 0);                        // 4 bits, 2 lignes, 5x8
  lcdSend(0x0C, 0);                        // affichage on, curseur off
  lcdSend(0x06, 0);                        // entry mode: incremente
  lcdSend(0x01, 0);                        // clear
}

// ============================================================================
// Trace PS/2 (DEBUG_PS2=1): evenements ecrits dans un petit anneau, affiches
// par loop() sur le terminal, ENTRELACES avec la sortie du 8088:
//   {76}  octet decode et valide      {>76} octet envoye au 8088
//   {P76} erreur de parite            {S76} erreur de stop
//   {G}   start invalide (parasite)   {Rn}  resync avec n bits recus
//   {O}   anneau PS/2 plein (octet perdu)   {g} parasite CLK filtre
// ============================================================================
#if DEBUG_PS2
static volatile uint16_t dbgBuf[64];
static volatile uint8_t  dbgHead = 0, dbgTail = 0;
static inline void dbg(uint16_t v) {       // appelable depuis l'ISR
  uint8_t nh = (uint8_t)((dbgHead + 1) & 63);
  if (nh != dbgTail) { dbgBuf[dbgHead] = v; dbgHead = nh; }
}
static void dbgSent(uint8_t v) {           // appelable depuis loop()
  noInterrupts(); dbg(0x600 | v); interrupts();
}
static void dbgFlush() {
  while (dbgHead != dbgTail && UsbSerial.availableForWrite() >= 8) {
    uint16_t v = dbgBuf[dbgTail];
    dbgTail = (uint8_t)((dbgTail + 1) & 63);
    uint8_t k = (uint8_t)(v >> 8), b = (uint8_t)v;
    UsbSerial.print('{');
    switch (k) {
      case 0: break;
      case 1: UsbSerial.print('P'); break;
      case 2: UsbSerial.print('S'); break;
      case 3: UsbSerial.print('G'); break;
      case 4: UsbSerial.print('O'); break;
      case 5: UsbSerial.print('R'); UsbSerial.print(b); UsbSerial.print('}'); continue;
      case 6: UsbSerial.print('>'); break;
      case 7: UsbSerial.print('g'); UsbSerial.print('}'); continue;
    }
    if (k != 3 && k != 4) { if (b < 16) UsbSerial.print('0'); UsbSerial.print(b, HEX); }
    UsbSerial.print('}');
  }
}
#else
#define dbg(v)     ((void)0)
#define dbgSent(v) ((void)0)
#define dbgFlush() ((void)0)
#endif

// ============================================================================
// Clavier PS/2 (Set 2): 11 bits = start(0) + 8 donnees LSB + parite impaire
// + stop(1), echantillonnes sur chaque front descendant de CLK.
// ============================================================================
static volatile uint8_t  ps2Buf[32];
static volatile uint8_t  ps2Head = 0, ps2Tail = 0;
static volatile uint8_t  ps2Bit = 0, ps2Shift = 0, ps2Par = 0, ps2ParOk = 0;
static volatile uint32_t ps2Last = 0;   // dernier front VALIDE de CLK
static volatile uint32_t ps2Act  = 0;   // dernier front CLK, valide ou non (silence)

