ve2cuy/breadboard-PC/arduino/8088_bridge_stm32/src/main.cpp
static inline bool ps2ClkHigh()  { return (GPIOA->IDR >> PS2_CLK_BIT) & 1; }
static inline bool ps2DataHigh() { return (GPIOA->IDR >> PS2_DATA_BIT) & 1; }

static void kbdTrack(uint8_t sc);          // Ctrl-Alt-Suppr (voir RESET du 8088, plus bas)

static void ps2Isr() {
  uint32_t now = micros();
  ps2Act = now;
  delayMicroseconds(PS2_GLITCH_US);
  if (ps2ClkHigh()) { dbg(0x700); return; }   // CLK repassee haute: parasite

  // DATA: vote majoritaire sur 3 lectures (encore stable a ce stade du cycle)
  uint8_t votes = 0;
  if (ps2DataHigh()) votes++;
  delayMicroseconds(2);
  if (ps2DataHigh()) votes++;
  delayMicroseconds(2);
  if (ps2DataHigh()) votes++;
  uint8_t b = (votes >= 2) ? 1 : 0;

  if ((uint32_t)(now - ps2Last) > PS2_FRAME_GAP_US) {   // nouvelle trame
    if (ps2Bit != 0) dbg(0x500 | ps2Bit);
    ps2Bit = 0;
  }
  ps2Last = now;

  if (ps2Bit == 0) {                       // bit de start: doit etre 0
    if (b) { dbg(0x300); return; }
    ps2Shift = 0; ps2Par = 0; ps2Bit = 1;
  } else if (ps2Bit <= 8) {                // 8 bits de donnees, LSB d'abord
    if (b) { ps2Shift |= (uint8_t)(1 << (ps2Bit - 1)); ps2Par ^= 1; }
    ps2Bit++;
  } else if (ps2Bit == 9) {                // parite impaire: donnees+parite = impair
    ps2ParOk = (b ^ ps2Par) & 1;
    ps2Bit++;
  } else {                                 // bit de stop: doit etre 1
    if (b && ps2ParOk) {
      uint8_t nh = (uint8_t)((ps2Head + 1) & 31);
      if (nh != ps2Tail) { ps2Buf[ps2Head] = ps2Shift; ps2Head = nh; dbg(ps2Shift); }
      else dbg(0x400);
      kbdTrack(ps2Shift);                  // Ctrl-Alt-Suppr -> reset du 8088 (meme s'il est fige)
    } else if (!ps2ParOk) dbg(0x100 | ps2Shift);
    else dbg(0x200 | ps2Shift);
    ps2Bit = 0;
  }
}

// Vrai si aucun front CLK n'a ete vu depuis au moins `us` microsecondes.
static bool ps2Quiet(uint32_t us) {
  noInterrupts();
  uint32_t last = ps2Act;
  interrupts();
  return (uint32_t)(micros() - last) >= us;
}

static bool ps2Pop(uint8_t &v) {
  if (ps2Head == ps2Tail) return false;
  v = ps2Buf[ps2Tail];
  ps2Tail = (uint8_t)((ps2Tail + 1) & 31);
  return true;
}

// ============================================================================
// RESET materiel du 8088 (PB2 -> broche 21, RESET actif HAUT)
// Le montage tire RESET a la masse (10 kohm) et son bouton le porte a +5 V: PB2 (tolerante 5 V) n'est
// donc JAMAIS forcee BAS - soit sortie HAUTE (reset en cours), soit ENTREE sans pull (le bouton marche).
// Demandes: demarrage du pont (setup: le 8088 reste en reset, horloge deja en marche, jusqu'a ce que le
// pont soit pret), Ctrl-Alt-Suppr au clavier PS/2 (kbdTrack, dans ps2Isr: detecte meme si le 8088 est
// fige et ne lit plus rien), Ctrl-\ au terminal (1Ch: n'est plus transmis au 8088 - son ISR faisait un
// redemarrage LOGICIEL, sans effet quand le 8088 est fige).
// ============================================================================
#define RESET8088_BIT      2               // GPIOB
#define RESET8088_PULSE_MS 10UL            // >> 4 cycles d'horloge exiges par le 8088
#define RESET_UART_KEY     0x1C            // Ctrl-\ (terminal)
#define STUCK_MS           500UL           // IBF = 1 depuis ce delai: le 8088 ne lit plus (fige)
static volatile bool resetRequest = false;

static void reset8088Hold() {              // sortie HAUTE (ODR avant MODER: aucune impulsion basse)
  __HAL_RCC_GPIOB_CLK_ENABLE();
  GPIOB->BSRR = (1UL << RESET8088_BIT);
  GPIOB->OTYPER &= ~(1UL << RESET8088_BIT);
  GPIOB->PUPDR &= ~(3UL << (RESET8088_BIT * 2));
  GPIOB->MODER = (GPIOB->MODER & ~(3UL << (RESET8088_BIT * 2))) | (1UL << (RESET8088_BIT * 2));
}
static void reset8088Release() {           // entree sans pull: les 10 kohm ramenent RESET a 0
  GPIOB->MODER &= ~(3UL << (RESET8088_BIT * 2));
}

// Clavier PS/2 (jeu 2): Ctrl (14h, E0 14h) + Alt (11h, E0 11h) enfonces + Suppr (71h, E0 71h) -> reset.
// Appelee par ps2Isr pour CHAQUE octet recu (rapide, aucun delai).
static volatile uint8_t kbdMods = 0;       // bit 0: F0 recu, bit 1: E0 recu, bit 2: Ctrl, bit 3: Alt
static void kbdTrack(uint8_t sc) {
  if (sc == 0xF0) { kbdMods |= 1; return; }
  if (sc == 0xE0) { kbdMods |= 2; return; }
  bool brk = kbdMods & 1;
  kbdMods &= (uint8_t)~3;
  uint8_t bit = (sc == 0x14) ? 4 : (sc == 0x11) ? 8 : 0;
  if (bit) { if (brk) kbdMods &= (uint8_t)~bit; else kbdMods |= bit; return; }
  if (!brk && sc == 0x71 && (kbdMods & 12) == 12) resetRequest = true;
}

// Impulsion de reset: l'ancienne session est oubliee (octets en attente dans les deux sens, commande
// partielle), puis RESET est relache - le 8088 repart au vecteur de reset (menu, RAM effacee).
static void reset8088Pulse() {
  reset8088Hold();
  noInterrupts();
  ps2Head = ps2Tail = 0;
  interrupts();
  qHead = qTail = 0;
  rqHead = rqTail = 0;
  cmdLen = 0;
  uartHoldUntil = 0;
  delay(RESET8088_PULSE_MS);
  reset8088Release();
  resetRequest = false;
}

// ============================================================================
// Initialisation des broches
// ============================================================================
static void pullUp(GPIO_TypeDef *port, uint8_t bit) {   // PUPDR = 01
  port->PUPDR = (port->PUPDR & ~(3UL << (bit * 2))) | (1UL << (bit * 2));
}

static void initPins() {
  // ACK#/STB#: DRAIN OUVERT. Le niveau haut est fourni par les 10 kohm vers +5 V
  // (vrai niveau 5 V pour le 8255, et lignes tenues hautes pendant un reset du
  // STM32). Pull-up interne en secours (3,3 V, suffisant pour l'entree TTL du 8255).
  pinMode(PIN_ACK, OUTPUT_OPEN_DRAIN);  ackHigh();  pullUp(GPIOB, ACK_BIT);
  pinMode(PIN_STB, OUTPUT_OPEN_DRAIN);  stbHigh();  pullUp(GPIOB, STB_BIT);
  pinMode(PIN_TAG, OUTPUT);   digitalWrite(PIN_TAG, LOW);
  pinMode(PIN_TAG1, OUTPUT);  digitalWrite(PIN_TAG1, LOW);   // PC1 (inutilise pour l'instant)
  pinMode(PIN_OBF, INPUT_PULLUP);          // 8255 absent/hors tension = "rien"
  pinMode(PIN_CH0, INPUT);
  pinMode(PIN_CH1, INPUT);
  pinMode(PIN_IBF, INPUT_PULLDOWN);        // non cable = "libre"

