ve2cuy/breadboard-PC/arduino/8088_bridge_stm32/src/main.cpp
  // Bus (PB6-PB9, PB12-PB15): entrees, sans pull, sorties push-pull rapides.
  // (L'horloge de GPIOB est deja activee par les pinMode() ci-dessus.)
  GPIOB->PUPDR   &= ~BUS_MODER_MASK;
  GPIOB->OTYPER  &= ~BUS_ODR_MASK;
  GPIOB->OSPEEDR |= 0xAA0AA000UL;          // 10 = grande vitesse
  busRelease();
}

// ============================================================================
void setup() {
  reset8088Hold();                         // le 8088 reste en RESET jusqu'a ce que le pont soit pret (fin de setup)
  clockSetup();                            // TOUT DE SUITE: le 8088 a besoin d'une horloge (aussi pendant son
                                            // reset) - avant tout ce qui suit (SPI/USB/RTC, lent)
#ifdef USE_TINYUSB
  fsMount();                               // la flash d'abord: le lecteur de masse en a besoin
  // Ce coeur n'appelle pas TinyUSB_Device_Init(): sans begin(0) le port USB ne demarre jamais
  // (aucun peripherique visible du PC). begin() efface la configuration (CDC ajoute par lui-meme),
  // donc le lecteur de masse s'ajoute APRES; si le PC a deja enumere, on se re-enumere.
  if (!TinyUSBDevice.isInitialized()) TinyUSBDevice.begin(0);
  usbMscBegin();
  UsbSerial.begin(115200);
  if (TinyUSBDevice.mounted()) {
    TinyUSBDevice.detach();
    delay(10);
    TinyUSBDevice.attach();
  }
#else
  UsbSerial.begin(115200);                 // USB natif: le debit est ignore (pas de DTR-reset)
#endif

#if RTC_USE_LSE
  rtc.setClockSource(STM32RTC::LSE_CLOCK);
#endif
  rtc.begin();                             // conserve l'heure si la RTC tournait deja (pile VBAT)

#ifndef USE_TINYUSB
  fsMount();                               // flash SPI + systeme de fichiers FAT (formate si neuve)
#endif
  // UsbSerial.println("\n8088_bridge_stm32: " __DATE__ " " __TIME__);
  initPins();

#if HEARTBEAT
  pinMode(PC13, OUTPUT);
  digitalWrite(PC13, HIGH);                // LED eteinte (active a l'etat bas)
#endif


  Wire.setSDA(PIN_SDA);
  Wire.setSCL(PIN_SCL);
  Wire.begin();
  Wire.setClock(100000);
  lcdInit();

  pinMode(PIN_PS2_CLK, INPUT_PULLUP);      // + pull-ups externes 4,7-10 kohm vers +5 V conseilles
  pinMode(PIN_PS2_DATA, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(PIN_PS2_CLK), ps2Isr, FALLING);

  delay(RESET8088_PULSE_MS);               // pont pret: le 8088 demarre (horloge stable depuis clockSetup)
  reset8088Release();
}

// Vrai si le 8088 peut recevoir un octet du pont
static uint32_t lastTx = 0;                // date du dernier octet envoye (USE_IBF=0)
static bool canSend() {
#if USE_IBF
  if ((GPIOA->IDR >> IBF_BIT) & 1) return false;   // IBF = 1: le 8088 n'a pas encore lu l'octet precedent
#endif
  return (uint32_t)(micros() - lastTx) >= GAP_US;
}
static inline void markSent() { lastTx = micros(); }

void loop() {
#ifdef USE_TINYUSB
  yield();                                 // tud_task(): traite les evenements USB (CDC, lecteur de masse)
#endif
  dbgFlush();

  // Reset du 8088 demande (Ctrl-Alt-Suppr, Ctrl-\). Si le 8088 ne lit plus rien, le terminal n'est plus
  // lu plus bas - on y cherche Ctrl-\ ici (les autres octets sont perdus: le 8088 ne les aurait jamais lus).
  // "Fige" = IBF = 1 (dernier octet envoye non lu) ET plus rien envoye depuis STUCK_MS. Premiere version
  // (1.2 initiale): IBF = 1 observe a CHAQUE debut de boucle pendant STUCK_MS - FAUX pendant un collage:
  // un tour de boucle (echo vers l'USB et le LCD I2C) peut durer plus que GAP_US, l'octet suivant partait
  // alors en fin de tour et le debut du tour suivant revoyait IBF = 1 - le 8088 semblait fige et le reste
  // du collage etait jete ("60 PI = 3.14159265" -> "60").
#if USE_IBF
  if (((GPIOA->IDR >> IBF_BIT) & 1) && (uint32_t)(micros() - lastTx) > STUCK_MS * 1000UL) {
    while (UsbSerial.available() > 0)
      if ((uint8_t)UsbSerial.read() == RESET_UART_KEY) { resetRequest = true; break; }
  }
#endif
  if (resetRequest) reset8088Pulse();

#if HEARTBEAT
  { static uint32_t t = 0;
    if (millis() - t >= 500) { t = millis(); digitalToggle(PC13); } }
#endif

  // 1. 8088 -> file
  if (!qFull() && ps2Quiet(BUS_QUIET_US)) {
    uint8_t chan, val;
    if (takeFrom8088(chan, val)) {
      q[qHead].chan = chan; q[qHead].val = val;
      qHead++;
    }
  }

  // 2. file -> UART (USB) ou LCD (un element par tour)
  if (!qEmpty()) {
    Item &it = q[qTail];
    if (it.chan == CH_UART) {
      static uint32_t stallSince = 0;
      if (UsbSerial.availableForWrite() > 0) {
        UsbSerial.write(it.val); qTail++; stallSince = 0;
      } else if (stallSince == 0) {
        stallSince = millis() | 1;
      } else if (millis() - stallSince > TX_STALL_MS) {
        qTail++; stallSince = 0;           // personne ne lit le port USB: octet jete
      }
    } else {
      if (it.chan == CH_LCD_CMD) {
        if (it.val == 0x28) lcdResync();   // Function Set = debut de i2c_lcd_init
                                           // (8088): resynchronise un LCD deregle
        lcdSend(it.val, 0);
      }
      else if (it.chan == CH_LCD_DATA) lcdSend(it.val, LCD_RS);
      else if (it.chan == CH_CMD) cmdByte(it.val);
      qTail++;                             // canal inconnu: octet jete
    }
  }

  // 3. reponses / clavier / UART recu -> 8088
  uint8_t v;
#if DEBUG_FS
  { // diagnostic: une reponse en attente depuis plus de 100 ms = bloquee (IBF? PS/2?)
    static uint32_t since = 0; static bool said = false;
    if (rqHead == rqTail) { since = 0; said = false; }
    else if (since == 0) since = millis() | 1;
    else if (!said && millis() - since > 100) {
      said = true;
      UsbSerial.print("[rq] bloquee: IBF="); UsbSerial.print((GPIOA->IDR >> IBF_BIT) & 1);
      UsbSerial.print(" ps2Quiet="); UsbSerial.print(ps2Quiet(BUS_QUIET_US));
      UsbSerial.print(" n="); UsbSerial.print((uint8_t)((rqHead - rqTail) & 63)); UsbSerial.print("\r\n");
    }
  }
#endif
#if USE_IBF
  // Reponse a une commande: IBF seul suffit (voir REPLY_GAP_US)
  if (rqHead != rqTail && !((GPIOA->IDR >> IBF_BIT) & 1) && (uint32_t)(micros() - lastTx) >= REPLY_GAP_US &&
      ps2Quiet(BUS_QUIET_US)) {
    v = rq[rqTail];
    rqTail = (uint8_t)((rqTail + 1) & 63);
    sendTo8088(2, v);
    markSent();
  } else
#endif
  if (canSend()) {                         // IBF libre (si cable) et GAP_US ecoule
    if (rqHead != rqTail && ps2Quiet(BUS_QUIET_US)) {           // reponse a une commande (sans IBF)
      v = rq[rqTail];
      rqTail = (uint8_t)((rqTail + 1) & 63);
      sendTo8088(2, v);
#if DEBUG_FS
      UsbSerial.print("[tx] "); UsbSerial.print(v, HEX); UsbSerial.print(" ibf="); UsbSerial.print(dbgIbfAfter); UsbSerial.print("\r\n");
#endif
      markSent();
    } else if (ps2Head != ps2Tail && ps2Quiet(KBD_QUIET_US)) {
      ps2Pop(v);
      sendTo8088(0, v);
      dbgSent(v);
      markSent();
    } else if (UsbSerial.available() > 0 && ps2Quiet(BUS_QUIET_US) &&
               (int32_t)(millis() - uartHoldUntil) >= 0) {
      uint8_t c = (uint8_t)UsbSerial.read();
      if (c == RESET_UART_KEY) {
        resetRequest = true;               // Ctrl-\: reset MATERIEL au prochain tour (non transmis)
      } else {
        sendTo8088(1, c);
        markSent();
        if (c == 13) uartHoldUntil = millis() + LINE_DELAY_MS;   // le 8088 traite la ligne
      }
    }
  }
}
